<template>
  <div>
    <Notice :list="listData" titleText="注意事項III" />
  </div>
</template>

<script>
import Notice from '@/components/UI/Notice.vue'

export default {
  name: 'Notice2',
  components: {
    Notice
  },
  data() {
    return {
      listData: [
        "<div>入場にはチケットの購入が必要です、詳しいは、<a href='https://agf-ikebukuro.jp/s/agf2024/page/ticket?ima=1051&tag=200' target='_blank' rel='noopener'>こちら</a>をご確認ください。</div>",
        'すべての出展内容に関して、予告無く変更や中止となる場合がございます。',
        '特典は数に限りがございますので、なくなり次第終了となります。',
        'ご購入や、各種会場企画、特典配布の列形成の際は、会場係員の誘導に従ってお並びください。',
        '待機列形成時のお客さま同士でのお待ち合わせは、ご遠慮いただいております。',
        '各種待機列が一定数に達した場合、混乱防止のため、整理券の配布対応とさせていただく場合がございます。整理券はお一人様につき1枚の配布となります。お連れ様の分の代替取得はできません。',
        '混乱時など、会場の安全確保のため、列形成の一時停止や、列の解消をお願いする場合がございます。ご理解、ご協力のほど、何卒よろしくお願い申し上げます。',
        '整理券の順に随時お客様をご案内いたします。記載時間の5分前にブースへお越しください。',
        'ご案内時間より後にブースに来られた場合、その時点の待機列最後尾にお並びいただくことになります。',
        '整理券の配布は数に限りがございます。',
        '整理券をお持ちのお客様のご案内終了後、ブースの混雑が緩和した際、整理券をお持ちでない方も物販などをご利用いただける可能性がございます。'
      ]
    }
  }
}
</script>
